/*  Task_7
Дан список. Выведите те его элементы, которые встречаются в списке только один
раз. Элементы нужно выводить в том порядке, в котором они встречаются в списке.
Входные данные
Вводится список чисел. Все числа списка находятся на одной строке.
Выходные данные
Выведите ответ на задачу.
Sample Input:
6
1
2
2
3
3
3
Sample Output:
1
*/ 



//import java.util.Scanner;
//class task7 {
//public static void main(String[] args){
//}
//}

class Test{
    public static void main(String[] args){
        System.out.println("Привет!");
        System.out.println("Эта строчка должна быть на новой строке!");
        System.out.print("И эта, так как предыдущая команда выполнила переход на новую строку");
        System.out.print("--- а это нет, так как просто System.out.print() по");
        System.out.print("сле себя строку не переводит");
    }
}