/*Task_3
В первый день спортсмен пробежал x километров, а затем он каждый день увеличивал 
пробег на 10% от предыдущего значения. По данному числу y определите номер дня, 
на который пробег спортсмена составит не менее y километров.
Входные данные
Программа получает на вход действительные числа x и y
Выходные данные
Программа должна вывести одно натуральное число.
Sample Input:
10
20
Sample Output:
9
*/

import java.util.Scanner;
class task3{
public static void main(String[] args){
    Scanner sc = new Scanner(System.in);
        System.out.printf("В 1-ый день спортсмен пробежал км: ");
        int x = sc.nextInt();
        System.out.printf("Спортсмен пробежал всего км: ");
        int y = sc.nextInt();
        day = 0;

}
}


